Revit 2027 API
LinkElementId Constructor
Overload List
Name | Description
LinkElementId(ElementId) |  Creates a new LinkElementId representing an element in the host document.
LinkElementId(ElementId, ElementId) |  Creates a new LinkElementId representing an element in a linked document.
Top
See Also
Reference
LinkElementId Class
Autodesk.Revit.DB Namespace